tutorials/suspensionFlows/equilibriumEulerianFoam/2DheterogeneousMedia/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default cellMDLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linerUpwind cellLimited Guass linear 1;//bounded Gauss linearUpwindV grad(U);
    div((nu*dev2(grad(U).T()))) Gauss linear;
    div((phi+phislip),c) Gauss linear;//upwind;//filteredLinear2 1 0; //linearUpwind grad(c);
}

laplacianSchemes
{
    default         Gauss linear limited 0.333;//corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
