tutorials/suspensionFlows/equilibriumEulerianFoam/2DheterogeneousMedia/system/tolerance
tol 1e-8;
#inputMode merge
